#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=17e0353ca4c5e46ab918cea3a11c9f17973fb37d]
local_file.tfkey: Refreshing state... [id=4a97d008d9f3a39fad7688b5a2e55ba1c828e752]
data.aws_ami.java-ami: Reading...
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_vpc.main: Refreshing state... [id=vpc-08fbeb5c2a5835b4e]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-06c2ffe7cddb975e9]
data.aws_ami.java-ami: Read complete after 1s [id=ami-03f9c676d52811cf1]
aws_security_group.elb: Refreshing state... [id=sg-03574d5c884dc9d19]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0b8cef58390019c0b]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-098b2568cb30e628f]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0247ba74caefb45d0]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-09fd503ac2f813803]
aws_security_group.allow_http: Refreshing state... [id=sg-01ffed9190e0d3190]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0580c609a910206af]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0ff8833ee3e0be13a]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-02c9909aba6a7f0c8]
aws_instance.bastion-host: Refreshing state... [id=i-070d5a43cbc5ac12f]
aws_launch_configuration.ec2_config: Refreshing state... [id=terraform-20230130165128543000000001]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0452b383680928659]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0781cd91364473b0f]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0f9246c231b62777b]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-03c6b7ab7626ac70e]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0a4bc636bdecd5586]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-02712839d0ec66f31]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230130165216048400000004]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ launch_configuration      = "terraform-20230130165128543000000001" -> (known after apply)
      ~ load_balancers            = [
          - "ELB",
        ]
        name                      = "Auto Scaling Group"
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_launch_configuration.ec2_config must be replaced
+/- resource "aws_launch_configuration" "ec2_config" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:856624563978:launchConfiguration:3af2957a-1b43-4209-a7c7-ca69e6f5a7f3:launchConfigurationName/terraform-20230130165128543000000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20230130165128543000000001" -> (known after apply)
      ~ image_id                         = "ami-0637d4fbbe7492f15" -> "ami-03f9c676d52811cf1" # forces replacement
      ~ name                             = "terraform-20230130165128543000000001" -> (known after apply)
      ~ name_prefix                      = "terraform-" -> (known after apply)
      - vpc_classic_link_security_groups = [] -> null
        # (6 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*